Revit 2026 API

# DockablePaneProviderData Class

---

Information about a new dockable pane being added to the Revit user interface.

SystemObject Autodesk.Revit.UIDockablePaneProviderData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DockablePaneProviderData
```
```vb
Public Class DockablePaneProviderData
```
```cpp
public ref class DockablePaneProviderData
```
```fsharp
type DockablePaneProviderData = class end
```

The DockablePaneProviderData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DockablePaneProviderData | Initializes a new instance of the DockablePaneProviderData class |

|  | Name | Description |
| --- | --- | --- |
|  | ContextualHelp | The contextual help associated with the pane. |
|  | EditorInteraction | Defines the interaction this pane has with the Active Editor when the pane becomes active. |
|  | FrameworkElement | The Windows Presentation Framework object containing the pane's user interface. |
|  | FrameworkElementCreator | A creator that will be called for the pane if the FrameworkElement is not set. |
|  | InitialState | The initial position of the docking pane. |
|  | VisibleByDefault | Controls the default visibility of the pane upon the first time the pane/plugin is loaded into Revit. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFrameworkElement | Wrapper function that returns the FrameworkElement for this provider. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace